In [ ]:
import numpy as np
import pandas as pd

In [ ]:
s1 = pd.Series(20)
s1

0    20
dtype: int64

In [ ]:
s1.index

RangeIndex(start=0, stop=1, step=1)

In [ ]:
s1.dtype1

dtype('int64')

In [ ]:
s2 = pd.Series(np.arange(200))
s2

0        0
1        1
2        2
3        3
4        4
      ...
195    195
196    196
197    197
198    198
199    199
Length: 200, dtype: int64

In [ ]:
# indexing
s2[4]

np.int64(4)

## data =, index = 명시해서 Series를 생성할 수 있다.

In [ ]:
# pd.Series?
s3 = pd.Series([1,2,3], ['Lora', 'Charlie', 'Violet'])
s3

Lora       1
Charlie    2
Violet     3
dtype: int64

In [ ]:
# 명시된 key를 통해서 인덱싱이 가능하다
s3['Violet']

np.int64(3)

In [ ]:
s4 = pd.Series([10,20,30], [100,200,300])
s4

100    10
200    20
300    30
dtype: int64

In [ ]:
s4[100]

np.int64(10)

In [ ]:
s5 = pd.Series([1,2,3], ['Lora', 'Lora', 'Violet'])
s5

Lora      1
Lora      2
Violet    3
dtype: int64

In [ ]:
#키값이 같은걸 다 가져온다
s5['Lora']

Lora    1
Lora    2
dtype: int64

## dict로 Series 생성하기

In [ ]:
income = {'홍길동' : 25000, '장보고' : 30000, '흰둥이' : 150000, '한우물' : -100000}
income

{'홍길동': 25000, '장보고': 30000, '흰둥이': 150000, '한우물': -100000}

In [ ]:
s6 = pd.Series(income)
s6
# dict(s6)

홍길동     25000
장보고     30000
흰둥이    150000
한우물   -100000
dtype: int64

In [ ]:
s7 = pd.Series(data = np.arange(5), index=np.arange(100, 105), dtype=np.int16)
s7

100    0
101    1
102    2
103    3
104    4
dtype: int16

In [ ]:
# 행 데이터
s7[[101]]

101    1
dtype: int16

In [ ]:
np.int16(1)

np.int16(1)

In [ ]:
# 행 데이터 중복키값 조회
s7[[100,100,100,100]]

100    0
100    0
100    0
100    0
dtype: int16

In [ ]:
s7[100] = 10000
s7

100    10000
101        1
102        2
103        3
104        4
dtype: int16

In [ ]:
# 102와 103의 데이터를 각각 10과 11로 변경하기

# s7[102] = 10
# s7[103] = 11

s7[[102, 103]] = 10, 11

s7

<ipython-input-42-62cd9bcf1119>:6: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '(10, 11)' has dtype incompatible with int16, please explicitly cast to a compatible dtype first.
  s7[[102, 103]] = 10, 11

100    10000
101        1
102       10
103       11
104        4
dtype: int64